Revit 2027 API
BuiltInFailures.SketchFailures.StairNotEnoughRiserCurvesError Property
 Boundaries (chains of one or more Boundary Lines) must be connected by at least two Riser Lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairNotEnoughRiserCurvesError { get; }
Public Shared ReadOnly Property StairNotEnoughRiserCurvesError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairNotEnoughRiserCurvesError {
	FailureDefinitionId^ get ();
}
static member StairNotEnoughRiserCurvesError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace